const content = {
    currentId: 0,

    consoles: [
        {
            title: "Nintendo DS",
            images: [
                "./img/nintendo/n2.1.jpg"
            ],
            texts: [
                "Nintendo DS — следующее поколение карманных игровых консолей компании Nintendo после Game Boy Advance SP. Консоль была выпущена в 2004 году в Канаде, США и Японии.",
                "Nintendo DS имеет дизайн «раскладушки» (первая версия очень похожа на Game & Watch) с двумя жидкокристаллическими экранами, причём нижний экран чувствителен к нажатию (англ. touch-screen) стилуса или пальца (рекомендуется использовать стилус), что используется во многих играх. Специальное покрытие экрана обеспечивает износостойкость, а прилагающийся к консоли стилус крепится на задней панели. Консоль имеет встроенный микрофон, который используется в некоторых играх для подачи голосовых команд либо обмена голосовыми сообщениями с другими консолями. Nintendo DS поддерживает стандарт беспроводной связи IEEE 802.11 (Wi-Fi), что позволяет организовать одновременное подключение 16-ти консолей, находящихся на расстоянии до 10-30 метров друг от друга. Для многих игр нескольким игрокам требуется только один картридж с игрой: используется функция Download Play, позволяющая загружать необходимую часть игры другими игроками у владельца картриджа. В приставке также имеются часы и будильник. Для настройки необходимого языка в игре зачастую необходимо изменить язык в самих настройках Nintendo DS.",
                "Стереозвук Nintendo DS обеспечивает эффект объемного звука, поддерживается использование стереонаушников со стандартным разъемом TRS. Оригинальная гарнитура идет вместе с микрофоном. С 26 января 2006 года доступна новая версия консоли — Nintendo DS Lite, отличающаяся меньшими размерами, улучшенным дизайном, а также более яркими экранами."
            ]
        },
        {
            title: "Nintendo 3DS",
            images: [
                "./img/nintendo/n3.1.jpg",
            ],
            texts: [
                "Nintendo 3DS — портативная игровая система производства Nintendo, способная создавать трёхмерный эффект изображения за счёт автостереоскопии, то есть без использования специальных очков. Консоль поступила в продажу во всех регионах до конца финансового года Nintendo, завершившегося в конце марта 2011 г. Игровая система присутствует на рынке одновременно с линейкой игровых систем Nintendo DS.",
                "Nintendo 3DS поступила в продажу в Японии 26 февраля 2011 года. Стоимость консоли составляла в Японии ¥25000 (около 300 долларов). В Америке же консоль появилась 27 марта по цене $249,99. В Европе (в том числе и в России) консоль появилась 25 марта и продавалась по цене €249,99, в Англии — £230, в Австралии — AU$350, в России — 12490 российских рублей.",
                "Поскольку продажи Nintendo 3DS не были столь высокими, как предполагала Nintendo, и в свою очередь это повлекло некоторые убытки, то было решено снизить цены на Nintendo 3DS. С 12 августа 2011 года цены на консоли снизились более чем на 40 % во всех регионах: в Америке — до $169,99, в Японии — до ¥15000, в Европе — до €169,99, в Англии — до £115, в Австралии — до AU$249,96. Для тех игроков, которые приобрели Nintendo 3DS и зарегистрировались в NintendoClub до 12 августа 2011 года Nintendo предложила программу Ambassador, по которой игроки могут скачать бесплатно 10 игр для Nintendo Entertainment System и 10 игр для Nintendo Gameboy.",
                "У некоторых американских и европейских игроков с первой прошивкой Nintendo 3DS (1.0.0-0) возникала проблема, которую позже назвали «чёрный экран смерти».[15] Эта ошибка заключалась в том, что во время игры появлялось сообщение об ошибке, после которого требовалась перезагрузка. Игровое сообщество предполагает, что ошибка вызвана попыткой консоли использовать беспроводное соединение одновременно с игрой. Проблема теоретически исправлена в обновлениях Nintendo 3DS."
            ]
        },
        {
            title: "Wii U",
            images: [
                "./img/nintendo/n4.1.jpg",
                "./img/nintendo/n4.2.jpg",
                "./img/nintendo/n4.3.jpg",
            ],
            texts: [
                "Wii U — название игровой консоли Nintendo, которая является преемником Wii. Система была представлена на пресс-конференции Nintendo 7 июня 2011 года на выставке E3 2011, выпущена в 2012 году. Производство прекращено в 2017 году в связи с выходом Nintendo Switch.",
                "Особенностью Wii U является новый контроллер, который может использоваться как дополнительный сенсорный экран, что позволит игроку получить новые игровые ощущения, а в некоторых играх частично заменить телевизор. Контроллер не совместим с играми Wii. Прототип Wii U был представлен на E3 2012.",
                "Консоль была задумана в 2008 году, после того как компания Nintendo осознала ряд ошибок и ограничений Wii. Основной проблемой стал тот факт, что консоль была рассчитана преимущественно на казуальную аудиторию. Одной из целей Wii U было привлечь более серьёзную игровую аудиторию. Геймдизайнер Сигэру Миямото признал, что отсутствие HD и ограниченная сетевая структура Wii способствовали тому, что консоль рассматривали отдельно от её основных конкурентов, таких как Xbox 360 и PlayStation 3. Было решено, что в новой консоли должны быть значительные структурные изменения.",
                "Консоль поступила в продажу 18 ноября 2012 года в США, 30 ноября в Европе, 8 декабря в Японии и 21 декабря — в России (в ряде сетевых магазинов был проведён ранний старт продаж 20 декабря). К 30 апреля 2014 года было продано 6,14 млн приставок. 31 января 2017 года Nintendo объявила о прекращении производства Wii U. По данным на 31 марта 2017 было произведено 13.56 млн консолей."
            ]
        },
        {
            title: "Nintendo Switch",
            images: [
                "./img/nintendo/n5.3.jpg",
                "./img/nintendo/n5.1.jpg",
                "./img/nintendo/n5.2.jpg",
            ],
            texts: [
                "Nintendo Switch — гибридная игровая консоль, разработанная японской компанией Nintendo. Nintendo Switch совмещает в себе свойства домашней игровой приставки и портативной игровой системы и может использоваться в обоих качествах. На этапе разработки Nintendo Switch носила кодовое название «Nintendo NX», была впервые продемонстрирована в октябре 2016 года и выпущена в продажу во всём мире 3 марта 2017 года.",
                "Nintendo Switch может работать как домашняя игровая приставка — в этом случае основное устройство приставки вставляется в специальную док-станцию, присоединённую к телевизору, и экран телевизора используется как средство вывода. Вне док-станции Nintendo Switch использует собственный сенсорный ЖК-экран — игрок может держать консоль в руках и взаимодействовать с ней как с планшетным компьютером либо разместить на столе перед несколькими участвующими в игре игроками, наподобие миниатюрного телевизора. Беспроводные контроллеры Joy-Con (джойконы), входящие в комплект с консолью, также можно использовать разными способами: прикрепить к обеим сторонам консоли для игры в портативном режиме, вставить их в аксессуар Grip, чтобы получить форму традиционного геймпада для домашней консоли, или использовать их отдельно от консоли как Wii Remote. Консоль не использует блокировку по региону.",
                "С 2014 года у Nintendo были финансовые потери, главным образом из-за плохих продаж её предыдущей консоли Wii U. Затем президент Nintendo Сатору Ивата подтолкнул компанию к мобильным и новым технологиям.",
                "Игровая консоль возглавила рейтинг лучших технических новинок 2017 года, составленный американским журналом Time."
            ]
        }
    ]
};