const content = {
    currentId: 0,

    consoles: [
        {
            title: "Sony Ericsson Xperia Play",
            images: [
                "./img/others/o2.1.jpg",
                "./img/others/o2.2.jpg"
            ],
            texts: [
                "Sony Ericsson Xperia Play — игровой Android-смартфон от Sony Ericsson. Впервые официально был анонсирован в феврале 2011 г. Исполнен в форм-факторе бокового слайдера. Имеет специальные игровые кнопки и сенсорные зоны. Модель работает на ОС Android 2.3 (Gingerbread), базируется на платформе Scorpion ARMv7 1 ГГц с встроенным графическим ускорителем. До официального анонса устройства в интернете ходили слухи о телефоне от Sony, ориентированном на игры. Этот слух распространили сторонние разработчики и некоторые даже выложили в интернет фото Xperia Play. До анонса устройство было известно как PlayStation Phone.",
                "Выдвижной геймпад повторяет структуру PlayStation Portable. От него PLAY унаследовал такие элементы как крестовина и четыре клавиши на правой стороне геймпада. Кроме того, на геймпаде расположились клавиши «меню», start и select,  а также два сенсорных тачпада для навигации в играх. Специально для игр предназначены клавиши L и R, которые находятся на правом торце смартфона. В обычном режиме работы они не несут никакой нагрузки, а вот клавиши на выдвижном геймпаде можно использовать для навигации по меню.",
                "Важное отличие Xperia PLAY от своих \"собратьев\" — моделей Xperia 2011 года, заключается в наличии клавиши «Поиск» на лицевой стороне в придачу к трем стандартным «Возврат», «Домой» и «Меню».",
            ]
        },
        {
            title: "Sega Dreamcast",
            images: [
                "./img/others/o3.1.jpeg"
            ],
            texts: [
                "Dreamcast — пятая и последняя игровая приставка компании Sega, наследник Sega Saturn. Приставка была выпущена за пятнадцать месяцев до выхода PlayStation 2 и за два года до GameCube с Xbox. Однако ей не удалось набрать популярности после выхода PlayStation 2, и Sega решила закрыть проект и уйти с рынка игровых приставок.",
                "Несмотря на то, что запуск Dreamcast был успешным, Sony со своей PlayStation по состоянию на конец 1999 года по-прежнему занимала 60 % рынка видеоигр в Северной Америке. 2 марта 1999 года в одном из докладов компания Sony представила первые детали своей «PlayStation нового поколения», которая, по словам Кена Кутараги, позволит видеоиграм передать «беспрецедентные эмоции». Основным элементом маркетинговых планов Sony и её грядущей PlayStation 2 был новый центральный процессор Emotion Engine с тактовой частотой в 294 МГц, разработанный совместно Sony и Toshiba. По словам Кутараги, система содержит графический процессор, который будет иметь пропускную способность в 1000 раз больше, чем современные ему графические процессоры персональных компьютеров, и что у него будет производительность с плавающей точкой в 6,2 гигафлопс. Компания Sony, инвестировавшая 1,2 миллиарда долларов США в два крупных завода по производству полупроводников для производства Emotion Engine и Graphics Synthesizer, спроектировала устройство так, чтобы оно выводило больше полигонов, чем любая другая игровая видеоприставка в истории. Sony заявляла, что PlayStation 2 может выводить 75 миллионов полигонов в секунду без каких-либо эффектов, и 38 миллионов с эффектами освещения и без учёта затрат на текстурирование, искусственный интеллект или игровую физику.",
                "22 мая 2000 года Окава сменил Иримадзири на посту президента Sega. Окава долгое время выступал за то, что Sega должна покинуть приставочный бизнес. Его настроения не были уникальными, соучредитель Sega Дэвид Розен «всегда считал некоторой глупостью то, что они ограничивали свой потенциал аппаратным обеспечением Sega», а Столар раньше предлагал что Sega должна была продать себя компании Microsoft. В сентябре 2000 года на встрече с японским руководством Sega и руководителями крупнейших японских студий по разработке игр Мур и Беллфилд высказали рекомендацию, что Sega должна отказаться от приставочного бизнеса и сосредоточиться на разработке программного обеспечения, что вынудило руководителей студий покинуть помещение.",
            ]
        },
        {
            title: "GP2X",
            images: [
                "./img/others/o4.1.jpg"
            ],
            texts: [
                "GP2X — портативный мультимедийный проигрыватель с функциями эмуляции, использующий программное обеспечение с открытым исходным кодом, основанное на Linux. Производится GamePark Holdings (GPH), основанной бывшими работниками Game Park. Её предшественником можно считать GP32 которая разрабатывалась Game Park. Наследником устройства являются GP2X Wiz и GP2X Caanoo.",
                "Устройство выпускалось в двух вариантах:",
                "GP2X F100 — базовая модель, выпущена 10 ноября 2005 года, только в Южной Корее;",
                "GP2X F200 — модель с D-pad и сенсорным экраном; выпущена 30 октября 2007 года;",
                "GP2X может эмулировать такие системы, как: Game Boy Advance, Mega CD, Neo Geo, Sega Genesis, Master System, Game Gear, Commodore 64, NES, PC-engine/TurboGrafx 16 и другие.",
            ]
        },
        {
            title: "Ouya",
            images: [
                "./img/others/o5.1.jpg",
                "./img/others/o5.2.jpg",
                "./img/others/o5.3.jpg",
            ],
            texts: [
                "Ouya — игровая приставка, выпущенная компанией Ouya Inc. (ранее Boxer8, Inc.) в 2013 году. Ouya была задумана как доступная и открытая альтернатива дорогостоящим приставкам; в качестве операционной системы использовалась Android. Разработка консоли была профинансирована посредством краудфандинга через сайт Kickstarter — запущенная разработчиками компания собрала свыше 8 миллионов долларов США и стала одной из самых успешных в истории этого сайта. Тем не менее Ouya провалилась в продажах: консоль страдала от проблем как с аппаратным, так и с программным обеспечением, но важнейшей из причин провала стал недостаток интересных для потребителя игр. В 2015 году разорившуюся компанию Ouya Inc. приобрела компания Razer, которая прекратила производство новых консолей, но осуществляла поддержку онлайн-сервисов для уже проданных устройств до 2019 года.",
                "Ouya была анонсирована 3 июля 2012 года как новая домашняя игровая приставка, сделанная командой экспертов во главе с Джулией Урман; компания-производитель консоли была первоначально зарегистрирована под названием Boxer8, но позже в том же году переименована в Ouya Inc. Анонс произошёл сразу же после конференции Google I/O, хотя и без какой-либо связи с ней, и мог воспользоваться поднятой этой конференцией волной интереса публики к новым устройствам на Android наподобие планшета Nexus 7.",
                "Через неделю после анонса начался сбор средств по созданию консоли и игр на сервисе Kickstarter. Менее чем через неделю акция собрала более миллиона долларов.",
                "Летом группа Джулии Урман подтверждает наличие рабочего прототипа и планирует предоставить свой собственный магазин приложений и игр, который будет называться «Ouya Store». Сама консоль будет размером с кубик Рубика. В качестве операционной системы разработчики выбрали Android с версией 4.1.2. Благодаря этому консоль имеет высокие характеристики и небольшую цену."
            ]
        }
    ]
}