const content = {
    currentId: 0,

    consoles: [
        {
            title: "XBOX 360",
            images: [
                "./img/xbox/xbox2.1.jpg",
                "./img/xbox/xbox2.2.jpg",
            ],
            texts: [
                "Xbox 360 — вторая по счёту игровая приставка компании Microsoft, которая последовала за Xbox. Конкурентами Xbox 360 среди игровых платформ седьмого поколения являются PlayStation 3 от Sony Computer Entertainment и Wii от Nintendo. Некоторые из основных функций Xbox 360 представлены сервисом Xbox Live, позволяющим играть через Интернет, а также загружать разнообразный контент — видеоигры, демоверсии, трейлеры, музыку, ТВ-шоу и т. п.",
                "Xbox 360 была официально анонсирована на канале MTV 12 мая 2005 года, а более детальная информация о приставке была представлена в том же месяце на выставке Electronic Entertainment Expo (E3). Все доступные на время выпуска приставки были успешно проданы в каждой стране, кроме Японии. По состоянию на июнь 2010 года, существует 41,7 миллиона приставок Xbox 360 по всему миру.",
                "В 2009 году на веб-сайте компьютерной тематики IGN Xbox 360 была названа шестой величайшей игровой приставкой всех времён, попав в список из 25 позиций. На крупнейшей выставке игр Electronic Entertainment Expo 2013 был представлен обновлённый дизайн Xbox 360.",
                "В момент анонса упомянутой Xbox 360 S Microsoft заявила, что их консоль просуществовала только половину своего рабочего цикла и что он продолжится до 2015 года. 20 апреля 2016 года было объявлено о прекращении производства."
            ]
        },
        {
            title: "XBOX One",
            images: [
                "./img/xbox/xbox3.1.jpg",
                "./img/xbox/xbox3.2.jpg",
                "./img/xbox/xbox3.3.jpg",
            ],
            texts: [
                "Xbox One — третья по счёту игровая приставка от компании Microsoft, являющаяся преемницей Xbox 360. Конкурентами Xbox One среди игровых платформ восьмого поколения являются PlayStation 4 от Sony Computer Entertainment, Wii U и Nintendo Switch от Nintendo.",
                "Анонс состоялся 21 мая 2013 года. Первые продажи приставки начались 22 ноября 2013 года в США, Канаде, Мексике, Бразилии, Австралии, Новой Зеландии, Великобритании, Ирландии, Германии, Франции, Австрии, Италии и Испании. Продажи в России, Бельгии, Нидерландах, Швейцарии, Норвегии, Дании, Швеции и Финляндии были позднее перенесены на сентябрь 2014 года. Датой запуска Xbox One в России стало 26 сентября 2014 года.",
                "В августе 2015 года Microsoft анонсировала новую версию геймпада Xbox One Elite. 13 июня 2016 года на выставке E3 2016 компания Microsoft представила модель Xbox One под названием Xbox One S. Данная модель отличается уменьшенным размером (на 40 % меньше оригинальной модели), возможностью вертикальной установки самой консоли, наличием версии со встроенным жёстким диском объёмом 2 ТБ, улучшенным геймпадом, возможностью проигрывать видеозаписи в разрешении 4K и поддержкой HDR. Выход новой модели консоли состоялся в августе 2016 года. Одновременно Microsoft анонсировала новую версию Xbox One под названием «Project Scorpio», главной особенностью которой является 8-ядерный процессор c производительностью до 6 TFLOPS, поддержка 4K-разрешения в играх и поддержка VR-шлемов (Oculus Rift, HTC Vive). 12 июня 2017 года на выставке E3 2017 был показан сам «Project Scorpio» под именем Xbox One X. Релиз консоли состоялся 7 ноября 2017 года.",
            ]
        },
        {
            title: "XBOX Series S",
            images: [
                "./img/xbox/xbox4.1.jpg",
            ],
            texts: [
                "Xbox Series X и Xbox Series S  — игровые приставки девятого поколения от американской транснациональной корпорации Microsoft. Series X и Series S являются новыми игровыми консолями в серии Xbox и преемницами Xbox One. Выпуск обеих приставок состоялся 10 ноября 2020 года. Главным конкурентом Xbox Series X/S среди игровых платформ следующего поколения стала приставка из серии PlayStation от Sony — PlayStation 5.",
                "В конце 2018 года начали появляться слухи, что Microsoft планирует выпустить две версии новой консоли: «Project Scarlett» (сейчас Xbox Series X) — с большей производительностью, ориентированную на хардкорных игроков приставку, а также «Project Lockhart» (сейчас Xbox Series S) — с более скромными комплектующими и ценой, но поддержкой сервиса облачных вычислений Project XCloud.",
                "Планировалось, что на E3 2019 покажут две консоли, однако в итоге на презентации рассказали только о «Project Scarlett». Данное решение вызвало слухи о том, что Microsoft отменила выпуск «Lockhart». Однако, в декабре 2019 года журналисты Kotaku, ссылаясь на свои источники, заявили, что «Lockhart» всё-таки разрабатывается. Стало известно, что анонс младшей версии новой Xbox тоже состоится «в скором времени». 8 сентября 2020 года Microsoft официально подтвердила существование Xbox Series S и её стоимость, назвав при этом самой маленькой Xbox в истории. Выход данной версии приставки также состоялся 10 ноября 2020 года."
            ]
        },
        {
            title: "XBOX Series X",
            images: [
                "./img/xbox/xbox5.1.jpg",
            ],
            texts: [
                "Впервые Microsoft рассказала о новой игровой платформе под кодовым названием «Project Scarlett» 10 июня 2019 года во время своей пресс-конференции на E3 2019. Microsoft сообщила, что новая консоль будет в четыре раза мощнее Xbox One X. В новинке будет установлена оперативная память нового стандарта GDDR6. Xbox «следующего поколения» будет оптимизирована под разрешение 4K с частотой кадров до 120 и поддержкой разрешения до 8K.",
                "Помимо этого, реализована полная поддержка новой технологии трассировки лучей в реальном времени. В качестве накопителя используется модифицированный NVMe SSD, который может быть задействован как виртуальная оперативная память. Это стало возможным благодаря разработанной инженерами Microsoft новой архитектуре Xbox Velocity — таким образом, приставка располагает куда большим объёмом оперативной памяти, нежели заявленные 16 ГБ нового стандарта GDDR6.",
                "12 декабря 2019 года на ежегодной церемонии награждения The Game Awards глава Xbox Фил Спенсер представил консоль нового поколения от Microsoft, которая получила своё официальное название — Xbox Series X. Таким образом, название «Project Scarlett», с которым она ассоциировалась ранее, устарело.",
                "Xbox Series X совместима с большинством игр, которые выходили на консоли семейства Xbox, однако не со всеми. Консоль поддерживает как диски, так и виртуальные копии игр. Фил Спенсер заявил, что ряд крупных игровых студий уже начали работу над играми для Xbox Series X. Чтобы продемонстрировать возможности новой приставки, зрителям показали дебютный трейлер игры Senua’s Saga: Hellblade II, которая является сиквелом Hellblade: Senua’s Sacrifice."
            ]
        }
    ]
}